----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1           [-1, 32, 63, 63]             864
       BatchNorm2d-2           [-1, 32, 63, 63]              64
              ReLU-3           [-1, 32, 63, 63]               0
         ConvBlock-4           [-1, 32, 63, 63]               0
            Conv2d-5           [-1, 64, 61, 61]          18,432
       BatchNorm2d-6           [-1, 64, 61, 61]             128
              ReLU-7           [-1, 64, 61, 61]               0
         ConvBlock-8           [-1, 64, 61, 61]               0
 XceptionInitBlock-9           [-1, 64, 61, 61]               0
           Conv2d-10          [-1, 128, 31, 31]           8,192
      BatchNorm2d-11          [-1, 128, 31, 31]             256
        ConvBlock-12          [-1, 128, 31, 31]               0
           Conv2d-13           [-1, 64, 61, 61]             576
           Conv2d-14          [-1, 128, 61, 61]           8,192
          DwsConv-15          [-1, 128, 61, 61]               0
      BatchNorm2d-16          [-1, 128, 61, 61]             256
     DwsConvBlock-17          [-1, 128, 61, 61]               0
             ReLU-18          [-1, 128, 61, 61]               0
           Conv2d-19          [-1, 128, 61, 61]           1,152
           Conv2d-20          [-1, 128, 61, 61]          16,384
          DwsConv-21          [-1, 128, 61, 61]               0
      BatchNorm2d-22          [-1, 128, 61, 61]             256
     DwsConvBlock-23          [-1, 128, 61, 61]               0
        MaxPool2d-24          [-1, 128, 31, 31]               0
     XceptionUnit-25          [-1, 128, 31, 31]               0
           Conv2d-26          [-1, 256, 16, 16]          32,768
      BatchNorm2d-27          [-1, 256, 16, 16]             512
        ConvBlock-28          [-1, 256, 16, 16]               0
             ReLU-29          [-1, 128, 31, 31]               0
           Conv2d-30          [-1, 128, 31, 31]           1,152
           Conv2d-31          [-1, 256, 31, 31]          32,768
          DwsConv-32          [-1, 256, 31, 31]               0
      BatchNorm2d-33          [-1, 256, 31, 31]             512
     DwsConvBlock-34          [-1, 256, 31, 31]               0
             ReLU-35          [-1, 256, 31, 31]               0
           Conv2d-36          [-1, 256, 31, 31]           2,304
           Conv2d-37          [-1, 256, 31, 31]          65,536
          DwsConv-38          [-1, 256, 31, 31]               0
      BatchNorm2d-39          [-1, 256, 31, 31]             512
     DwsConvBlock-40          [-1, 256, 31, 31]               0
        MaxPool2d-41          [-1, 256, 16, 16]               0
     XceptionUnit-42          [-1, 256, 16, 16]               0
           Conv2d-43            [-1, 728, 8, 8]         186,368
      BatchNorm2d-44            [-1, 728, 8, 8]           1,456
        ConvBlock-45            [-1, 728, 8, 8]               0
             ReLU-46          [-1, 256, 16, 16]               0
           Conv2d-47          [-1, 256, 16, 16]           2,304
           Conv2d-48          [-1, 728, 16, 16]         186,368
          DwsConv-49          [-1, 728, 16, 16]               0
      BatchNorm2d-50          [-1, 728, 16, 16]           1,456
     DwsConvBlock-51          [-1, 728, 16, 16]               0
             ReLU-52          [-1, 728, 16, 16]               0
           Conv2d-53          [-1, 728, 16, 16]           6,552
           Conv2d-54          [-1, 728, 16, 16]         529,984
          DwsConv-55          [-1, 728, 16, 16]               0
      BatchNorm2d-56          [-1, 728, 16, 16]           1,456
     DwsConvBlock-57          [-1, 728, 16, 16]               0
        MaxPool2d-58            [-1, 728, 8, 8]               0
     XceptionUnit-59            [-1, 728, 8, 8]               0
             ReLU-60            [-1, 728, 8, 8]               0
           Conv2d-61            [-1, 728, 8, 8]           6,552
           Conv2d-62            [-1, 728, 8, 8]         529,984
          DwsConv-63            [-1, 728, 8, 8]               0
      BatchNorm2d-64            [-1, 728, 8, 8]           1,456
     DwsConvBlock-65            [-1, 728, 8, 8]               0
             ReLU-66            [-1, 728, 8, 8]               0
           Conv2d-67            [-1, 728, 8, 8]           6,552
           Conv2d-68            [-1, 728, 8, 8]         529,984
          DwsConv-69            [-1, 728, 8, 8]               0
      BatchNorm2d-70            [-1, 728, 8, 8]           1,456
     DwsConvBlock-71            [-1, 728, 8, 8]               0
             ReLU-72            [-1, 728, 8, 8]               0
           Conv2d-73            [-1, 728, 8, 8]           6,552
           Conv2d-74            [-1, 728, 8, 8]         529,984
          DwsConv-75            [-1, 728, 8, 8]               0
      BatchNorm2d-76            [-1, 728, 8, 8]           1,456
     DwsConvBlock-77            [-1, 728, 8, 8]               0
     XceptionUnit-78            [-1, 728, 8, 8]               0
             ReLU-79            [-1, 728, 8, 8]               0
           Conv2d-80            [-1, 728, 8, 8]           6,552
           Conv2d-81            [-1, 728, 8, 8]         529,984
          DwsConv-82            [-1, 728, 8, 8]               0
      BatchNorm2d-83            [-1, 728, 8, 8]           1,456
     DwsConvBlock-84            [-1, 728, 8, 8]               0
             ReLU-85            [-1, 728, 8, 8]               0
           Conv2d-86            [-1, 728, 8, 8]           6,552
           Conv2d-87            [-1, 728, 8, 8]         529,984
          DwsConv-88            [-1, 728, 8, 8]               0
      BatchNorm2d-89            [-1, 728, 8, 8]           1,456
     DwsConvBlock-90            [-1, 728, 8, 8]               0
             ReLU-91            [-1, 728, 8, 8]               0
           Conv2d-92            [-1, 728, 8, 8]           6,552
           Conv2d-93            [-1, 728, 8, 8]         529,984
          DwsConv-94            [-1, 728, 8, 8]               0
      BatchNorm2d-95            [-1, 728, 8, 8]           1,456
     DwsConvBlock-96            [-1, 728, 8, 8]               0
     XceptionUnit-97            [-1, 728, 8, 8]               0
             ReLU-98            [-1, 728, 8, 8]               0
           Conv2d-99            [-1, 728, 8, 8]           6,552
          Conv2d-100            [-1, 728, 8, 8]         529,984
         DwsConv-101            [-1, 728, 8, 8]               0
     BatchNorm2d-102            [-1, 728, 8, 8]           1,456
    DwsConvBlock-103            [-1, 728, 8, 8]               0
            ReLU-104            [-1, 728, 8, 8]               0
          Conv2d-105            [-1, 728, 8, 8]           6,552
          Conv2d-106            [-1, 728, 8, 8]         529,984
         DwsConv-107            [-1, 728, 8, 8]               0
     BatchNorm2d-108            [-1, 728, 8, 8]           1,456
    DwsConvBlock-109            [-1, 728, 8, 8]               0
            ReLU-110            [-1, 728, 8, 8]               0
          Conv2d-111            [-1, 728, 8, 8]           6,552
          Conv2d-112            [-1, 728, 8, 8]         529,984
         DwsConv-113            [-1, 728, 8, 8]               0
     BatchNorm2d-114            [-1, 728, 8, 8]           1,456
    DwsConvBlock-115            [-1, 728, 8, 8]               0
    XceptionUnit-116            [-1, 728, 8, 8]               0
            ReLU-117            [-1, 728, 8, 8]               0
          Conv2d-118            [-1, 728, 8, 8]           6,552
          Conv2d-119            [-1, 728, 8, 8]         529,984
         DwsConv-120            [-1, 728, 8, 8]               0
     BatchNorm2d-121            [-1, 728, 8, 8]           1,456
    DwsConvBlock-122            [-1, 728, 8, 8]               0
            ReLU-123            [-1, 728, 8, 8]               0
          Conv2d-124            [-1, 728, 8, 8]           6,552
          Conv2d-125            [-1, 728, 8, 8]         529,984
         DwsConv-126            [-1, 728, 8, 8]               0
     BatchNorm2d-127            [-1, 728, 8, 8]           1,456
    DwsConvBlock-128            [-1, 728, 8, 8]               0
            ReLU-129            [-1, 728, 8, 8]               0
          Conv2d-130            [-1, 728, 8, 8]           6,552
          Conv2d-131            [-1, 728, 8, 8]         529,984
         DwsConv-132            [-1, 728, 8, 8]               0
     BatchNorm2d-133            [-1, 728, 8, 8]           1,456
    DwsConvBlock-134            [-1, 728, 8, 8]               0
    XceptionUnit-135            [-1, 728, 8, 8]               0
            ReLU-136            [-1, 728, 8, 8]               0
          Conv2d-137            [-1, 728, 8, 8]           6,552
          Conv2d-138            [-1, 728, 8, 8]         529,984
         DwsConv-139            [-1, 728, 8, 8]               0
     BatchNorm2d-140            [-1, 728, 8, 8]           1,456
    DwsConvBlock-141            [-1, 728, 8, 8]               0
            ReLU-142            [-1, 728, 8, 8]               0
          Conv2d-143            [-1, 728, 8, 8]           6,552
          Conv2d-144            [-1, 728, 8, 8]         529,984
         DwsConv-145            [-1, 728, 8, 8]               0
     BatchNorm2d-146            [-1, 728, 8, 8]           1,456
    DwsConvBlock-147            [-1, 728, 8, 8]               0
            ReLU-148            [-1, 728, 8, 8]               0
          Conv2d-149            [-1, 728, 8, 8]           6,552
          Conv2d-150            [-1, 728, 8, 8]         529,984
         DwsConv-151            [-1, 728, 8, 8]               0
     BatchNorm2d-152            [-1, 728, 8, 8]           1,456
    DwsConvBlock-153            [-1, 728, 8, 8]               0
    XceptionUnit-154            [-1, 728, 8, 8]               0
            ReLU-155            [-1, 728, 8, 8]               0
          Conv2d-156            [-1, 728, 8, 8]           6,552
          Conv2d-157            [-1, 728, 8, 8]         529,984
         DwsConv-158            [-1, 728, 8, 8]               0
     BatchNorm2d-159            [-1, 728, 8, 8]           1,456
    DwsConvBlock-160            [-1, 728, 8, 8]               0
            ReLU-161            [-1, 728, 8, 8]               0
          Conv2d-162            [-1, 728, 8, 8]           6,552
          Conv2d-163            [-1, 728, 8, 8]         529,984
         DwsConv-164            [-1, 728, 8, 8]               0
     BatchNorm2d-165            [-1, 728, 8, 8]           1,456
    DwsConvBlock-166            [-1, 728, 8, 8]               0
            ReLU-167            [-1, 728, 8, 8]               0
          Conv2d-168            [-1, 728, 8, 8]           6,552
          Conv2d-169            [-1, 728, 8, 8]         529,984
         DwsConv-170            [-1, 728, 8, 8]               0
     BatchNorm2d-171            [-1, 728, 8, 8]           1,456
    DwsConvBlock-172            [-1, 728, 8, 8]               0
    XceptionUnit-173            [-1, 728, 8, 8]               0
            ReLU-174            [-1, 728, 8, 8]               0
          Conv2d-175            [-1, 728, 8, 8]           6,552
          Conv2d-176            [-1, 728, 8, 8]         529,984
         DwsConv-177            [-1, 728, 8, 8]               0
     BatchNorm2d-178            [-1, 728, 8, 8]           1,456
    DwsConvBlock-179            [-1, 728, 8, 8]               0
            ReLU-180            [-1, 728, 8, 8]               0
          Conv2d-181            [-1, 728, 8, 8]           6,552
          Conv2d-182            [-1, 728, 8, 8]         529,984
         DwsConv-183            [-1, 728, 8, 8]               0
     BatchNorm2d-184            [-1, 728, 8, 8]           1,456
    DwsConvBlock-185            [-1, 728, 8, 8]               0
            ReLU-186            [-1, 728, 8, 8]               0
          Conv2d-187            [-1, 728, 8, 8]           6,552
          Conv2d-188            [-1, 728, 8, 8]         529,984
         DwsConv-189            [-1, 728, 8, 8]               0
     BatchNorm2d-190            [-1, 728, 8, 8]           1,456
    DwsConvBlock-191            [-1, 728, 8, 8]               0
    XceptionUnit-192            [-1, 728, 8, 8]               0
            ReLU-193            [-1, 728, 8, 8]               0
          Conv2d-194            [-1, 728, 8, 8]           6,552
          Conv2d-195            [-1, 728, 8, 8]         529,984
         DwsConv-196            [-1, 728, 8, 8]               0
     BatchNorm2d-197            [-1, 728, 8, 8]           1,456
    DwsConvBlock-198            [-1, 728, 8, 8]               0
            ReLU-199            [-1, 728, 8, 8]               0
          Conv2d-200            [-1, 728, 8, 8]           6,552
          Conv2d-201            [-1, 728, 8, 8]         529,984
         DwsConv-202            [-1, 728, 8, 8]               0
     BatchNorm2d-203            [-1, 728, 8, 8]           1,456
    DwsConvBlock-204            [-1, 728, 8, 8]               0
            ReLU-205            [-1, 728, 8, 8]               0
          Conv2d-206            [-1, 728, 8, 8]           6,552
          Conv2d-207            [-1, 728, 8, 8]         529,984
         DwsConv-208            [-1, 728, 8, 8]               0
     BatchNorm2d-209            [-1, 728, 8, 8]           1,456
    DwsConvBlock-210            [-1, 728, 8, 8]               0
    XceptionUnit-211            [-1, 728, 8, 8]               0
          Conv2d-212           [-1, 1024, 4, 4]         745,472
     BatchNorm2d-213           [-1, 1024, 4, 4]           2,048
       ConvBlock-214           [-1, 1024, 4, 4]               0
            ReLU-215            [-1, 728, 8, 8]               0
          Conv2d-216            [-1, 728, 8, 8]           6,552
          Conv2d-217            [-1, 728, 8, 8]         529,984
         DwsConv-218            [-1, 728, 8, 8]               0
     BatchNorm2d-219            [-1, 728, 8, 8]           1,456
    DwsConvBlock-220            [-1, 728, 8, 8]               0
            ReLU-221            [-1, 728, 8, 8]               0
          Conv2d-222            [-1, 728, 8, 8]           6,552
          Conv2d-223           [-1, 1024, 8, 8]         745,472
         DwsConv-224           [-1, 1024, 8, 8]               0
     BatchNorm2d-225           [-1, 1024, 8, 8]           2,048
    DwsConvBlock-226           [-1, 1024, 8, 8]               0
       MaxPool2d-227           [-1, 1024, 4, 4]               0
    XceptionUnit-228           [-1, 1024, 4, 4]               0
          Conv2d-229           [-1, 1024, 4, 4]           9,216
          Conv2d-230           [-1, 1536, 4, 4]       1,572,864
         DwsConv-231           [-1, 1536, 4, 4]               0
     BatchNorm2d-232           [-1, 1536, 4, 4]           3,072
    DwsConvBlock-233           [-1, 1536, 4, 4]               0
            ReLU-234           [-1, 1536, 4, 4]               0
          Conv2d-235           [-1, 1536, 4, 4]          13,824
          Conv2d-236           [-1, 2048, 4, 4]       3,145,728
         DwsConv-237           [-1, 2048, 4, 4]               0
     BatchNorm2d-238           [-1, 2048, 4, 4]           4,096
    DwsConvBlock-239           [-1, 2048, 4, 4]               0
            ReLU-240           [-1, 2048, 4, 4]               0
AdaptiveAvgPool2d-241           [-1, 2048, 1, 1]               0
XceptionFinalBlock-242           [-1, 2048, 1, 1]               0
         Flatten-243                 [-1, 2048]               0
     BatchNorm1d-244                 [-1, 2048]           4,096
         Dropout-245                 [-1, 2048]               0
          Linear-246                  [-1, 512]       1,049,088
            ReLU-247                  [-1, 512]               0
     BatchNorm1d-248                  [-1, 512]           1,024
         Dropout-249                  [-1, 512]               0
          Linear-250                    [-1, 1]             513
 ClassifierBlock-251                    [-1, 1]               0
================================================================
Total params: 21,861,673
Trainable params: 21,861,673
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.19
Forward/backward pass size (MB): 158.04
Params size (MB): 83.40
Estimated Total Size (MB): 241.63
----------------------------------------------------------------
