----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
         ZeroPad2d-1          [-1, 3, 129, 129]               0
Conv2dStaticSamePadding-2           [-1, 32, 64, 64]             864
       BatchNorm2d-3           [-1, 32, 64, 64]              64
MemoryEfficientSwish-4           [-1, 32, 64, 64]               0
         ZeroPad2d-5           [-1, 32, 66, 66]               0
Conv2dStaticSamePadding-6           [-1, 32, 64, 64]             288
       BatchNorm2d-7           [-1, 32, 64, 64]              64
MemoryEfficientSwish-8           [-1, 32, 64, 64]               0
          Identity-9             [-1, 32, 1, 1]               0
Conv2dStaticSamePadding-10              [-1, 8, 1, 1]             264
MemoryEfficientSwish-11              [-1, 8, 1, 1]               0
         Identity-12              [-1, 8, 1, 1]               0
Conv2dStaticSamePadding-13             [-1, 32, 1, 1]             288
         Identity-14           [-1, 32, 64, 64]               0
Conv2dStaticSamePadding-15           [-1, 16, 64, 64]             512
      BatchNorm2d-16           [-1, 16, 64, 64]              32
      MBConvBlock-17           [-1, 16, 64, 64]               0
         Identity-18           [-1, 16, 64, 64]               0
Conv2dStaticSamePadding-19           [-1, 96, 64, 64]           1,536
      BatchNorm2d-20           [-1, 96, 64, 64]             192
MemoryEfficientSwish-21           [-1, 96, 64, 64]               0
        ZeroPad2d-22           [-1, 96, 65, 65]               0
Conv2dStaticSamePadding-23           [-1, 96, 32, 32]             864
      BatchNorm2d-24           [-1, 96, 32, 32]             192
MemoryEfficientSwish-25           [-1, 96, 32, 32]               0
         Identity-26             [-1, 96, 1, 1]               0
Conv2dStaticSamePadding-27              [-1, 4, 1, 1]             388
MemoryEfficientSwish-28              [-1, 4, 1, 1]               0
         Identity-29              [-1, 4, 1, 1]               0
Conv2dStaticSamePadding-30             [-1, 96, 1, 1]             480
         Identity-31           [-1, 96, 32, 32]               0
Conv2dStaticSamePadding-32           [-1, 24, 32, 32]           2,304
      BatchNorm2d-33           [-1, 24, 32, 32]              48
      MBConvBlock-34           [-1, 24, 32, 32]               0
         Identity-35           [-1, 24, 32, 32]               0
Conv2dStaticSamePadding-36          [-1, 144, 32, 32]           3,456
      BatchNorm2d-37          [-1, 144, 32, 32]             288
MemoryEfficientSwish-38          [-1, 144, 32, 32]               0
        ZeroPad2d-39          [-1, 144, 34, 34]               0
Conv2dStaticSamePadding-40          [-1, 144, 32, 32]           1,296
      BatchNorm2d-41          [-1, 144, 32, 32]             288
MemoryEfficientSwish-42          [-1, 144, 32, 32]               0
         Identity-43            [-1, 144, 1, 1]               0
Conv2dStaticSamePadding-44              [-1, 6, 1, 1]             870
MemoryEfficientSwish-45              [-1, 6, 1, 1]               0
         Identity-46              [-1, 6, 1, 1]               0
Conv2dStaticSamePadding-47            [-1, 144, 1, 1]           1,008
         Identity-48          [-1, 144, 32, 32]               0
Conv2dStaticSamePadding-49           [-1, 24, 32, 32]           3,456
      BatchNorm2d-50           [-1, 24, 32, 32]              48
      MBConvBlock-51           [-1, 24, 32, 32]               0
         Identity-52           [-1, 24, 32, 32]               0
Conv2dStaticSamePadding-53          [-1, 144, 32, 32]           3,456
      BatchNorm2d-54          [-1, 144, 32, 32]             288
MemoryEfficientSwish-55          [-1, 144, 32, 32]               0
        ZeroPad2d-56          [-1, 144, 35, 35]               0
Conv2dStaticSamePadding-57          [-1, 144, 16, 16]           3,600
      BatchNorm2d-58          [-1, 144, 16, 16]             288
MemoryEfficientSwish-59          [-1, 144, 16, 16]               0
         Identity-60            [-1, 144, 1, 1]               0
Conv2dStaticSamePadding-61              [-1, 6, 1, 1]             870
MemoryEfficientSwish-62              [-1, 6, 1, 1]               0
         Identity-63              [-1, 6, 1, 1]               0
Conv2dStaticSamePadding-64            [-1, 144, 1, 1]           1,008
         Identity-65          [-1, 144, 16, 16]               0
Conv2dStaticSamePadding-66           [-1, 40, 16, 16]           5,760
      BatchNorm2d-67           [-1, 40, 16, 16]              80
      MBConvBlock-68           [-1, 40, 16, 16]               0
         Identity-69           [-1, 40, 16, 16]               0
Conv2dStaticSamePadding-70          [-1, 240, 16, 16]           9,600
      BatchNorm2d-71          [-1, 240, 16, 16]             480
MemoryEfficientSwish-72          [-1, 240, 16, 16]               0
        ZeroPad2d-73          [-1, 240, 20, 20]               0
Conv2dStaticSamePadding-74          [-1, 240, 16, 16]           6,000
      BatchNorm2d-75          [-1, 240, 16, 16]             480
MemoryEfficientSwish-76          [-1, 240, 16, 16]               0
         Identity-77            [-1, 240, 1, 1]               0
Conv2dStaticSamePadding-78             [-1, 10, 1, 1]           2,410
MemoryEfficientSwish-79             [-1, 10, 1, 1]               0
         Identity-80             [-1, 10, 1, 1]               0
Conv2dStaticSamePadding-81            [-1, 240, 1, 1]           2,640
         Identity-82          [-1, 240, 16, 16]               0
Conv2dStaticSamePadding-83           [-1, 40, 16, 16]           9,600
      BatchNorm2d-84           [-1, 40, 16, 16]              80
      MBConvBlock-85           [-1, 40, 16, 16]               0
         Identity-86           [-1, 40, 16, 16]               0
Conv2dStaticSamePadding-87          [-1, 240, 16, 16]           9,600
      BatchNorm2d-88          [-1, 240, 16, 16]             480
MemoryEfficientSwish-89          [-1, 240, 16, 16]               0
        ZeroPad2d-90          [-1, 240, 17, 17]               0
Conv2dStaticSamePadding-91            [-1, 240, 8, 8]           2,160
      BatchNorm2d-92            [-1, 240, 8, 8]             480
MemoryEfficientSwish-93            [-1, 240, 8, 8]               0
         Identity-94            [-1, 240, 1, 1]               0
Conv2dStaticSamePadding-95             [-1, 10, 1, 1]           2,410
MemoryEfficientSwish-96             [-1, 10, 1, 1]               0
         Identity-97             [-1, 10, 1, 1]               0
Conv2dStaticSamePadding-98            [-1, 240, 1, 1]           2,640
         Identity-99            [-1, 240, 8, 8]               0
Conv2dStaticSamePadding-100             [-1, 80, 8, 8]          19,200
     BatchNorm2d-101             [-1, 80, 8, 8]             160
     MBConvBlock-102             [-1, 80, 8, 8]               0
        Identity-103             [-1, 80, 8, 8]               0
Conv2dStaticSamePadding-104            [-1, 480, 8, 8]          38,400
     BatchNorm2d-105            [-1, 480, 8, 8]             960
MemoryEfficientSwish-106            [-1, 480, 8, 8]               0
       ZeroPad2d-107          [-1, 480, 10, 10]               0
Conv2dStaticSamePadding-108            [-1, 480, 8, 8]           4,320
     BatchNorm2d-109            [-1, 480, 8, 8]             960
MemoryEfficientSwish-110            [-1, 480, 8, 8]               0
        Identity-111            [-1, 480, 1, 1]               0
Conv2dStaticSamePadding-112             [-1, 20, 1, 1]           9,620
MemoryEfficientSwish-113             [-1, 20, 1, 1]               0
        Identity-114             [-1, 20, 1, 1]               0
Conv2dStaticSamePadding-115            [-1, 480, 1, 1]          10,080
        Identity-116            [-1, 480, 8, 8]               0
Conv2dStaticSamePadding-117             [-1, 80, 8, 8]          38,400
     BatchNorm2d-118             [-1, 80, 8, 8]             160
     MBConvBlock-119             [-1, 80, 8, 8]               0
        Identity-120             [-1, 80, 8, 8]               0
Conv2dStaticSamePadding-121            [-1, 480, 8, 8]          38,400
     BatchNorm2d-122            [-1, 480, 8, 8]             960
MemoryEfficientSwish-123            [-1, 480, 8, 8]               0
       ZeroPad2d-124          [-1, 480, 10, 10]               0
Conv2dStaticSamePadding-125            [-1, 480, 8, 8]           4,320
     BatchNorm2d-126            [-1, 480, 8, 8]             960
MemoryEfficientSwish-127            [-1, 480, 8, 8]               0
        Identity-128            [-1, 480, 1, 1]               0
Conv2dStaticSamePadding-129             [-1, 20, 1, 1]           9,620
MemoryEfficientSwish-130             [-1, 20, 1, 1]               0
        Identity-131             [-1, 20, 1, 1]               0
Conv2dStaticSamePadding-132            [-1, 480, 1, 1]          10,080
        Identity-133            [-1, 480, 8, 8]               0
Conv2dStaticSamePadding-134             [-1, 80, 8, 8]          38,400
     BatchNorm2d-135             [-1, 80, 8, 8]             160
     MBConvBlock-136             [-1, 80, 8, 8]               0
        Identity-137             [-1, 80, 8, 8]               0
Conv2dStaticSamePadding-138            [-1, 480, 8, 8]          38,400
     BatchNorm2d-139            [-1, 480, 8, 8]             960
MemoryEfficientSwish-140            [-1, 480, 8, 8]               0
       ZeroPad2d-141          [-1, 480, 12, 12]               0
Conv2dStaticSamePadding-142            [-1, 480, 8, 8]          12,000
     BatchNorm2d-143            [-1, 480, 8, 8]             960
MemoryEfficientSwish-144            [-1, 480, 8, 8]               0
        Identity-145            [-1, 480, 1, 1]               0
Conv2dStaticSamePadding-146             [-1, 20, 1, 1]           9,620
MemoryEfficientSwish-147             [-1, 20, 1, 1]               0
        Identity-148             [-1, 20, 1, 1]               0
Conv2dStaticSamePadding-149            [-1, 480, 1, 1]          10,080
        Identity-150            [-1, 480, 8, 8]               0
Conv2dStaticSamePadding-151            [-1, 112, 8, 8]          53,760
     BatchNorm2d-152            [-1, 112, 8, 8]             224
     MBConvBlock-153            [-1, 112, 8, 8]               0
        Identity-154            [-1, 112, 8, 8]               0
Conv2dStaticSamePadding-155            [-1, 672, 8, 8]          75,264
     BatchNorm2d-156            [-1, 672, 8, 8]           1,344
MemoryEfficientSwish-157            [-1, 672, 8, 8]               0
       ZeroPad2d-158          [-1, 672, 12, 12]               0
Conv2dStaticSamePadding-159            [-1, 672, 8, 8]          16,800
     BatchNorm2d-160            [-1, 672, 8, 8]           1,344
MemoryEfficientSwish-161            [-1, 672, 8, 8]               0
        Identity-162            [-1, 672, 1, 1]               0
Conv2dStaticSamePadding-163             [-1, 28, 1, 1]          18,844
MemoryEfficientSwish-164             [-1, 28, 1, 1]               0
        Identity-165             [-1, 28, 1, 1]               0
Conv2dStaticSamePadding-166            [-1, 672, 1, 1]          19,488
        Identity-167            [-1, 672, 8, 8]               0
Conv2dStaticSamePadding-168            [-1, 112, 8, 8]          75,264
     BatchNorm2d-169            [-1, 112, 8, 8]             224
     MBConvBlock-170            [-1, 112, 8, 8]               0
        Identity-171            [-1, 112, 8, 8]               0
Conv2dStaticSamePadding-172            [-1, 672, 8, 8]          75,264
     BatchNorm2d-173            [-1, 672, 8, 8]           1,344
MemoryEfficientSwish-174            [-1, 672, 8, 8]               0
       ZeroPad2d-175          [-1, 672, 12, 12]               0
Conv2dStaticSamePadding-176            [-1, 672, 8, 8]          16,800
     BatchNorm2d-177            [-1, 672, 8, 8]           1,344
MemoryEfficientSwish-178            [-1, 672, 8, 8]               0
        Identity-179            [-1, 672, 1, 1]               0
Conv2dStaticSamePadding-180             [-1, 28, 1, 1]          18,844
MemoryEfficientSwish-181             [-1, 28, 1, 1]               0
        Identity-182             [-1, 28, 1, 1]               0
Conv2dStaticSamePadding-183            [-1, 672, 1, 1]          19,488
        Identity-184            [-1, 672, 8, 8]               0
Conv2dStaticSamePadding-185            [-1, 112, 8, 8]          75,264
     BatchNorm2d-186            [-1, 112, 8, 8]             224
     MBConvBlock-187            [-1, 112, 8, 8]               0
        Identity-188            [-1, 112, 8, 8]               0
Conv2dStaticSamePadding-189            [-1, 672, 8, 8]          75,264
     BatchNorm2d-190            [-1, 672, 8, 8]           1,344
MemoryEfficientSwish-191            [-1, 672, 8, 8]               0
       ZeroPad2d-192          [-1, 672, 11, 11]               0
Conv2dStaticSamePadding-193            [-1, 672, 4, 4]          16,800
     BatchNorm2d-194            [-1, 672, 4, 4]           1,344
MemoryEfficientSwish-195            [-1, 672, 4, 4]               0
        Identity-196            [-1, 672, 1, 1]               0
Conv2dStaticSamePadding-197             [-1, 28, 1, 1]          18,844
MemoryEfficientSwish-198             [-1, 28, 1, 1]               0
        Identity-199             [-1, 28, 1, 1]               0
Conv2dStaticSamePadding-200            [-1, 672, 1, 1]          19,488
        Identity-201            [-1, 672, 4, 4]               0
Conv2dStaticSamePadding-202            [-1, 192, 4, 4]         129,024
     BatchNorm2d-203            [-1, 192, 4, 4]             384
     MBConvBlock-204            [-1, 192, 4, 4]               0
        Identity-205            [-1, 192, 4, 4]               0
Conv2dStaticSamePadding-206           [-1, 1152, 4, 4]         221,184
     BatchNorm2d-207           [-1, 1152, 4, 4]           2,304
MemoryEfficientSwish-208           [-1, 1152, 4, 4]               0
       ZeroPad2d-209           [-1, 1152, 8, 8]               0
Conv2dStaticSamePadding-210           [-1, 1152, 4, 4]          28,800
     BatchNorm2d-211           [-1, 1152, 4, 4]           2,304
MemoryEfficientSwish-212           [-1, 1152, 4, 4]               0
        Identity-213           [-1, 1152, 1, 1]               0
Conv2dStaticSamePadding-214             [-1, 48, 1, 1]          55,344
MemoryEfficientSwish-215             [-1, 48, 1, 1]               0
        Identity-216             [-1, 48, 1, 1]               0
Conv2dStaticSamePadding-217           [-1, 1152, 1, 1]          56,448
        Identity-218           [-1, 1152, 4, 4]               0
Conv2dStaticSamePadding-219            [-1, 192, 4, 4]         221,184
     BatchNorm2d-220            [-1, 192, 4, 4]             384
     MBConvBlock-221            [-1, 192, 4, 4]               0
        Identity-222            [-1, 192, 4, 4]               0
Conv2dStaticSamePadding-223           [-1, 1152, 4, 4]         221,184
     BatchNorm2d-224           [-1, 1152, 4, 4]           2,304
MemoryEfficientSwish-225           [-1, 1152, 4, 4]               0
       ZeroPad2d-226           [-1, 1152, 8, 8]               0
Conv2dStaticSamePadding-227           [-1, 1152, 4, 4]          28,800
     BatchNorm2d-228           [-1, 1152, 4, 4]           2,304
MemoryEfficientSwish-229           [-1, 1152, 4, 4]               0
        Identity-230           [-1, 1152, 1, 1]               0
Conv2dStaticSamePadding-231             [-1, 48, 1, 1]          55,344
MemoryEfficientSwish-232             [-1, 48, 1, 1]               0
        Identity-233             [-1, 48, 1, 1]               0
Conv2dStaticSamePadding-234           [-1, 1152, 1, 1]          56,448
        Identity-235           [-1, 1152, 4, 4]               0
Conv2dStaticSamePadding-236            [-1, 192, 4, 4]         221,184
     BatchNorm2d-237            [-1, 192, 4, 4]             384
     MBConvBlock-238            [-1, 192, 4, 4]               0
        Identity-239            [-1, 192, 4, 4]               0
Conv2dStaticSamePadding-240           [-1, 1152, 4, 4]         221,184
     BatchNorm2d-241           [-1, 1152, 4, 4]           2,304
MemoryEfficientSwish-242           [-1, 1152, 4, 4]               0
       ZeroPad2d-243           [-1, 1152, 8, 8]               0
Conv2dStaticSamePadding-244           [-1, 1152, 4, 4]          28,800
     BatchNorm2d-245           [-1, 1152, 4, 4]           2,304
MemoryEfficientSwish-246           [-1, 1152, 4, 4]               0
        Identity-247           [-1, 1152, 1, 1]               0
Conv2dStaticSamePadding-248             [-1, 48, 1, 1]          55,344
MemoryEfficientSwish-249             [-1, 48, 1, 1]               0
        Identity-250             [-1, 48, 1, 1]               0
Conv2dStaticSamePadding-251           [-1, 1152, 1, 1]          56,448
        Identity-252           [-1, 1152, 4, 4]               0
Conv2dStaticSamePadding-253            [-1, 192, 4, 4]         221,184
     BatchNorm2d-254            [-1, 192, 4, 4]             384
     MBConvBlock-255            [-1, 192, 4, 4]               0
        Identity-256            [-1, 192, 4, 4]               0
Conv2dStaticSamePadding-257           [-1, 1152, 4, 4]         221,184
     BatchNorm2d-258           [-1, 1152, 4, 4]           2,304
MemoryEfficientSwish-259           [-1, 1152, 4, 4]               0
       ZeroPad2d-260           [-1, 1152, 6, 6]               0
Conv2dStaticSamePadding-261           [-1, 1152, 4, 4]          10,368
     BatchNorm2d-262           [-1, 1152, 4, 4]           2,304
MemoryEfficientSwish-263           [-1, 1152, 4, 4]               0
        Identity-264           [-1, 1152, 1, 1]               0
Conv2dStaticSamePadding-265             [-1, 48, 1, 1]          55,344
MemoryEfficientSwish-266             [-1, 48, 1, 1]               0
        Identity-267             [-1, 48, 1, 1]               0
Conv2dStaticSamePadding-268           [-1, 1152, 1, 1]          56,448
        Identity-269           [-1, 1152, 4, 4]               0
Conv2dStaticSamePadding-270            [-1, 320, 4, 4]         368,640
     BatchNorm2d-271            [-1, 320, 4, 4]             640
     MBConvBlock-272            [-1, 320, 4, 4]               0
        Identity-273            [-1, 320, 4, 4]               0
Conv2dStaticSamePadding-274           [-1, 1280, 4, 4]         409,600
     BatchNorm2d-275           [-1, 1280, 4, 4]           2,560
MemoryEfficientSwish-276           [-1, 1280, 4, 4]               0
AdaptiveAvgPool2d-277           [-1, 1280, 1, 1]               0
        Identity-278                 [-1, 1280]               0
        Identity-279                 [-1, 1280]               0
    EfficientNet-280                 [-1, 1280]               0
       ZeroPad2d-281          [-1, 1, 129, 129]               0
Conv2dStaticSamePadding-282           [-1, 32, 64, 64]             288
     BatchNorm2d-283           [-1, 32, 64, 64]              64
MemoryEfficientSwish-284           [-1, 32, 64, 64]               0
       ZeroPad2d-285           [-1, 32, 66, 66]               0
Conv2dStaticSamePadding-286           [-1, 32, 64, 64]             288
     BatchNorm2d-287           [-1, 32, 64, 64]              64
MemoryEfficientSwish-288           [-1, 32, 64, 64]               0
        Identity-289             [-1, 32, 1, 1]               0
Conv2dStaticSamePadding-290              [-1, 8, 1, 1]             264
MemoryEfficientSwish-291              [-1, 8, 1, 1]               0
        Identity-292              [-1, 8, 1, 1]               0
Conv2dStaticSamePadding-293             [-1, 32, 1, 1]             288
        Identity-294           [-1, 32, 64, 64]               0
Conv2dStaticSamePadding-295           [-1, 16, 64, 64]             512
     BatchNorm2d-296           [-1, 16, 64, 64]              32
     MBConvBlock-297           [-1, 16, 64, 64]               0
        Identity-298           [-1, 16, 64, 64]               0
Conv2dStaticSamePadding-299           [-1, 96, 64, 64]           1,536
     BatchNorm2d-300           [-1, 96, 64, 64]             192
MemoryEfficientSwish-301           [-1, 96, 64, 64]               0
       ZeroPad2d-302           [-1, 96, 65, 65]               0
Conv2dStaticSamePadding-303           [-1, 96, 32, 32]             864
     BatchNorm2d-304           [-1, 96, 32, 32]             192
MemoryEfficientSwish-305           [-1, 96, 32, 32]               0
        Identity-306             [-1, 96, 1, 1]               0
Conv2dStaticSamePadding-307              [-1, 4, 1, 1]             388
MemoryEfficientSwish-308              [-1, 4, 1, 1]               0
        Identity-309              [-1, 4, 1, 1]               0
Conv2dStaticSamePadding-310             [-1, 96, 1, 1]             480
        Identity-311           [-1, 96, 32, 32]               0
Conv2dStaticSamePadding-312           [-1, 24, 32, 32]           2,304
     BatchNorm2d-313           [-1, 24, 32, 32]              48
     MBConvBlock-314           [-1, 24, 32, 32]               0
        Identity-315           [-1, 24, 32, 32]               0
Conv2dStaticSamePadding-316          [-1, 144, 32, 32]           3,456
     BatchNorm2d-317          [-1, 144, 32, 32]             288
MemoryEfficientSwish-318          [-1, 144, 32, 32]               0
       ZeroPad2d-319          [-1, 144, 34, 34]               0
Conv2dStaticSamePadding-320          [-1, 144, 32, 32]           1,296
     BatchNorm2d-321          [-1, 144, 32, 32]             288
MemoryEfficientSwish-322          [-1, 144, 32, 32]               0
        Identity-323            [-1, 144, 1, 1]               0
Conv2dStaticSamePadding-324              [-1, 6, 1, 1]             870
MemoryEfficientSwish-325              [-1, 6, 1, 1]               0
        Identity-326              [-1, 6, 1, 1]               0
Conv2dStaticSamePadding-327            [-1, 144, 1, 1]           1,008
        Identity-328          [-1, 144, 32, 32]               0
Conv2dStaticSamePadding-329           [-1, 24, 32, 32]           3,456
     BatchNorm2d-330           [-1, 24, 32, 32]              48
     MBConvBlock-331           [-1, 24, 32, 32]               0
        Identity-332           [-1, 24, 32, 32]               0
Conv2dStaticSamePadding-333          [-1, 144, 32, 32]           3,456
     BatchNorm2d-334          [-1, 144, 32, 32]             288
MemoryEfficientSwish-335          [-1, 144, 32, 32]               0
       ZeroPad2d-336          [-1, 144, 35, 35]               0
Conv2dStaticSamePadding-337          [-1, 144, 16, 16]           3,600
     BatchNorm2d-338          [-1, 144, 16, 16]             288
MemoryEfficientSwish-339          [-1, 144, 16, 16]               0
        Identity-340            [-1, 144, 1, 1]               0
Conv2dStaticSamePadding-341              [-1, 6, 1, 1]             870
MemoryEfficientSwish-342              [-1, 6, 1, 1]               0
        Identity-343              [-1, 6, 1, 1]               0
Conv2dStaticSamePadding-344            [-1, 144, 1, 1]           1,008
        Identity-345          [-1, 144, 16, 16]               0
Conv2dStaticSamePadding-346           [-1, 40, 16, 16]           5,760
     BatchNorm2d-347           [-1, 40, 16, 16]              80
     MBConvBlock-348           [-1, 40, 16, 16]               0
        Identity-349           [-1, 40, 16, 16]               0
Conv2dStaticSamePadding-350          [-1, 240, 16, 16]           9,600
     BatchNorm2d-351          [-1, 240, 16, 16]             480
MemoryEfficientSwish-352          [-1, 240, 16, 16]               0
       ZeroPad2d-353          [-1, 240, 20, 20]               0
Conv2dStaticSamePadding-354          [-1, 240, 16, 16]           6,000
     BatchNorm2d-355          [-1, 240, 16, 16]             480
MemoryEfficientSwish-356          [-1, 240, 16, 16]               0
        Identity-357            [-1, 240, 1, 1]               0
Conv2dStaticSamePadding-358             [-1, 10, 1, 1]           2,410
MemoryEfficientSwish-359             [-1, 10, 1, 1]               0
        Identity-360             [-1, 10, 1, 1]               0
Conv2dStaticSamePadding-361            [-1, 240, 1, 1]           2,640
        Identity-362          [-1, 240, 16, 16]               0
Conv2dStaticSamePadding-363           [-1, 40, 16, 16]           9,600
     BatchNorm2d-364           [-1, 40, 16, 16]              80
     MBConvBlock-365           [-1, 40, 16, 16]               0
        Identity-366           [-1, 40, 16, 16]               0
Conv2dStaticSamePadding-367          [-1, 240, 16, 16]           9,600
     BatchNorm2d-368          [-1, 240, 16, 16]             480
MemoryEfficientSwish-369          [-1, 240, 16, 16]               0
       ZeroPad2d-370          [-1, 240, 17, 17]               0
Conv2dStaticSamePadding-371            [-1, 240, 8, 8]           2,160
     BatchNorm2d-372            [-1, 240, 8, 8]             480
MemoryEfficientSwish-373            [-1, 240, 8, 8]               0
        Identity-374            [-1, 240, 1, 1]               0
Conv2dStaticSamePadding-375             [-1, 10, 1, 1]           2,410
MemoryEfficientSwish-376             [-1, 10, 1, 1]               0
        Identity-377             [-1, 10, 1, 1]               0
Conv2dStaticSamePadding-378            [-1, 240, 1, 1]           2,640
        Identity-379            [-1, 240, 8, 8]               0
Conv2dStaticSamePadding-380             [-1, 80, 8, 8]          19,200
     BatchNorm2d-381             [-1, 80, 8, 8]             160
     MBConvBlock-382             [-1, 80, 8, 8]               0
        Identity-383             [-1, 80, 8, 8]               0
Conv2dStaticSamePadding-384            [-1, 480, 8, 8]          38,400
     BatchNorm2d-385            [-1, 480, 8, 8]             960
MemoryEfficientSwish-386            [-1, 480, 8, 8]               0
       ZeroPad2d-387          [-1, 480, 10, 10]               0
Conv2dStaticSamePadding-388            [-1, 480, 8, 8]           4,320
     BatchNorm2d-389            [-1, 480, 8, 8]             960
MemoryEfficientSwish-390            [-1, 480, 8, 8]               0
        Identity-391            [-1, 480, 1, 1]               0
Conv2dStaticSamePadding-392             [-1, 20, 1, 1]           9,620
MemoryEfficientSwish-393             [-1, 20, 1, 1]               0
        Identity-394             [-1, 20, 1, 1]               0
Conv2dStaticSamePadding-395            [-1, 480, 1, 1]          10,080
        Identity-396            [-1, 480, 8, 8]               0
Conv2dStaticSamePadding-397             [-1, 80, 8, 8]          38,400
     BatchNorm2d-398             [-1, 80, 8, 8]             160
     MBConvBlock-399             [-1, 80, 8, 8]               0
        Identity-400             [-1, 80, 8, 8]               0
Conv2dStaticSamePadding-401            [-1, 480, 8, 8]          38,400
     BatchNorm2d-402            [-1, 480, 8, 8]             960
MemoryEfficientSwish-403            [-1, 480, 8, 8]               0
       ZeroPad2d-404          [-1, 480, 10, 10]               0
Conv2dStaticSamePadding-405            [-1, 480, 8, 8]           4,320
     BatchNorm2d-406            [-1, 480, 8, 8]             960
MemoryEfficientSwish-407            [-1, 480, 8, 8]               0
        Identity-408            [-1, 480, 1, 1]               0
Conv2dStaticSamePadding-409             [-1, 20, 1, 1]           9,620
MemoryEfficientSwish-410             [-1, 20, 1, 1]               0
        Identity-411             [-1, 20, 1, 1]               0
Conv2dStaticSamePadding-412            [-1, 480, 1, 1]          10,080
        Identity-413            [-1, 480, 8, 8]               0
Conv2dStaticSamePadding-414             [-1, 80, 8, 8]          38,400
     BatchNorm2d-415             [-1, 80, 8, 8]             160
     MBConvBlock-416             [-1, 80, 8, 8]               0
        Identity-417             [-1, 80, 8, 8]               0
Conv2dStaticSamePadding-418            [-1, 480, 8, 8]          38,400
     BatchNorm2d-419            [-1, 480, 8, 8]             960
MemoryEfficientSwish-420            [-1, 480, 8, 8]               0
       ZeroPad2d-421          [-1, 480, 12, 12]               0
Conv2dStaticSamePadding-422            [-1, 480, 8, 8]          12,000
     BatchNorm2d-423            [-1, 480, 8, 8]             960
MemoryEfficientSwish-424            [-1, 480, 8, 8]               0
        Identity-425            [-1, 480, 1, 1]               0
Conv2dStaticSamePadding-426             [-1, 20, 1, 1]           9,620
MemoryEfficientSwish-427             [-1, 20, 1, 1]               0
        Identity-428             [-1, 20, 1, 1]               0
Conv2dStaticSamePadding-429            [-1, 480, 1, 1]          10,080
        Identity-430            [-1, 480, 8, 8]               0
Conv2dStaticSamePadding-431            [-1, 112, 8, 8]          53,760
     BatchNorm2d-432            [-1, 112, 8, 8]             224
     MBConvBlock-433            [-1, 112, 8, 8]               0
        Identity-434            [-1, 112, 8, 8]               0
Conv2dStaticSamePadding-435            [-1, 672, 8, 8]          75,264
     BatchNorm2d-436            [-1, 672, 8, 8]           1,344
MemoryEfficientSwish-437            [-1, 672, 8, 8]               0
       ZeroPad2d-438          [-1, 672, 12, 12]               0
Conv2dStaticSamePadding-439            [-1, 672, 8, 8]          16,800
     BatchNorm2d-440            [-1, 672, 8, 8]           1,344
MemoryEfficientSwish-441            [-1, 672, 8, 8]               0
        Identity-442            [-1, 672, 1, 1]               0
Conv2dStaticSamePadding-443             [-1, 28, 1, 1]          18,844
MemoryEfficientSwish-444             [-1, 28, 1, 1]               0
        Identity-445             [-1, 28, 1, 1]               0
Conv2dStaticSamePadding-446            [-1, 672, 1, 1]          19,488
        Identity-447            [-1, 672, 8, 8]               0
Conv2dStaticSamePadding-448            [-1, 112, 8, 8]          75,264
     BatchNorm2d-449            [-1, 112, 8, 8]             224
     MBConvBlock-450            [-1, 112, 8, 8]               0
        Identity-451            [-1, 112, 8, 8]               0
Conv2dStaticSamePadding-452            [-1, 672, 8, 8]          75,264
     BatchNorm2d-453            [-1, 672, 8, 8]           1,344
MemoryEfficientSwish-454            [-1, 672, 8, 8]               0
       ZeroPad2d-455          [-1, 672, 12, 12]               0
Conv2dStaticSamePadding-456            [-1, 672, 8, 8]          16,800
     BatchNorm2d-457            [-1, 672, 8, 8]           1,344
MemoryEfficientSwish-458            [-1, 672, 8, 8]               0
        Identity-459            [-1, 672, 1, 1]               0
Conv2dStaticSamePadding-460             [-1, 28, 1, 1]          18,844
MemoryEfficientSwish-461             [-1, 28, 1, 1]               0
        Identity-462             [-1, 28, 1, 1]               0
Conv2dStaticSamePadding-463            [-1, 672, 1, 1]          19,488
        Identity-464            [-1, 672, 8, 8]               0
Conv2dStaticSamePadding-465            [-1, 112, 8, 8]          75,264
     BatchNorm2d-466            [-1, 112, 8, 8]             224
     MBConvBlock-467            [-1, 112, 8, 8]               0
        Identity-468            [-1, 112, 8, 8]               0
Conv2dStaticSamePadding-469            [-1, 672, 8, 8]          75,264
     BatchNorm2d-470            [-1, 672, 8, 8]           1,344
MemoryEfficientSwish-471            [-1, 672, 8, 8]               0
       ZeroPad2d-472          [-1, 672, 11, 11]               0
Conv2dStaticSamePadding-473            [-1, 672, 4, 4]          16,800
     BatchNorm2d-474            [-1, 672, 4, 4]           1,344
MemoryEfficientSwish-475            [-1, 672, 4, 4]               0
        Identity-476            [-1, 672, 1, 1]               0
Conv2dStaticSamePadding-477             [-1, 28, 1, 1]          18,844
MemoryEfficientSwish-478             [-1, 28, 1, 1]               0
        Identity-479             [-1, 28, 1, 1]               0
Conv2dStaticSamePadding-480            [-1, 672, 1, 1]          19,488
        Identity-481            [-1, 672, 4, 4]               0
Conv2dStaticSamePadding-482            [-1, 192, 4, 4]         129,024
     BatchNorm2d-483            [-1, 192, 4, 4]             384
     MBConvBlock-484            [-1, 192, 4, 4]               0
        Identity-485            [-1, 192, 4, 4]               0
Conv2dStaticSamePadding-486           [-1, 1152, 4, 4]         221,184
     BatchNorm2d-487           [-1, 1152, 4, 4]           2,304
MemoryEfficientSwish-488           [-1, 1152, 4, 4]               0
       ZeroPad2d-489           [-1, 1152, 8, 8]               0
Conv2dStaticSamePadding-490           [-1, 1152, 4, 4]          28,800
     BatchNorm2d-491           [-1, 1152, 4, 4]           2,304
MemoryEfficientSwish-492           [-1, 1152, 4, 4]               0
        Identity-493           [-1, 1152, 1, 1]               0
Conv2dStaticSamePadding-494             [-1, 48, 1, 1]          55,344
MemoryEfficientSwish-495             [-1, 48, 1, 1]               0
        Identity-496             [-1, 48, 1, 1]               0
Conv2dStaticSamePadding-497           [-1, 1152, 1, 1]          56,448
        Identity-498           [-1, 1152, 4, 4]               0
Conv2dStaticSamePadding-499            [-1, 192, 4, 4]         221,184
     BatchNorm2d-500            [-1, 192, 4, 4]             384
     MBConvBlock-501            [-1, 192, 4, 4]               0
        Identity-502            [-1, 192, 4, 4]               0
Conv2dStaticSamePadding-503           [-1, 1152, 4, 4]         221,184
     BatchNorm2d-504           [-1, 1152, 4, 4]           2,304
MemoryEfficientSwish-505           [-1, 1152, 4, 4]               0
       ZeroPad2d-506           [-1, 1152, 8, 8]               0
Conv2dStaticSamePadding-507           [-1, 1152, 4, 4]          28,800
     BatchNorm2d-508           [-1, 1152, 4, 4]           2,304
MemoryEfficientSwish-509           [-1, 1152, 4, 4]               0
        Identity-510           [-1, 1152, 1, 1]               0
Conv2dStaticSamePadding-511             [-1, 48, 1, 1]          55,344
MemoryEfficientSwish-512             [-1, 48, 1, 1]               0
        Identity-513             [-1, 48, 1, 1]               0
Conv2dStaticSamePadding-514           [-1, 1152, 1, 1]          56,448
        Identity-515           [-1, 1152, 4, 4]               0
Conv2dStaticSamePadding-516            [-1, 192, 4, 4]         221,184
     BatchNorm2d-517            [-1, 192, 4, 4]             384
     MBConvBlock-518            [-1, 192, 4, 4]               0
        Identity-519            [-1, 192, 4, 4]               0
Conv2dStaticSamePadding-520           [-1, 1152, 4, 4]         221,184
     BatchNorm2d-521           [-1, 1152, 4, 4]           2,304
MemoryEfficientSwish-522           [-1, 1152, 4, 4]               0
       ZeroPad2d-523           [-1, 1152, 8, 8]               0
Conv2dStaticSamePadding-524           [-1, 1152, 4, 4]          28,800
     BatchNorm2d-525           [-1, 1152, 4, 4]           2,304
MemoryEfficientSwish-526           [-1, 1152, 4, 4]               0
        Identity-527           [-1, 1152, 1, 1]               0
Conv2dStaticSamePadding-528             [-1, 48, 1, 1]          55,344
MemoryEfficientSwish-529             [-1, 48, 1, 1]               0
        Identity-530             [-1, 48, 1, 1]               0
Conv2dStaticSamePadding-531           [-1, 1152, 1, 1]          56,448
        Identity-532           [-1, 1152, 4, 4]               0
Conv2dStaticSamePadding-533            [-1, 192, 4, 4]         221,184
     BatchNorm2d-534            [-1, 192, 4, 4]             384
     MBConvBlock-535            [-1, 192, 4, 4]               0
        Identity-536            [-1, 192, 4, 4]               0
Conv2dStaticSamePadding-537           [-1, 1152, 4, 4]         221,184
     BatchNorm2d-538           [-1, 1152, 4, 4]           2,304
MemoryEfficientSwish-539           [-1, 1152, 4, 4]               0
       ZeroPad2d-540           [-1, 1152, 6, 6]               0
Conv2dStaticSamePadding-541           [-1, 1152, 4, 4]          10,368
     BatchNorm2d-542           [-1, 1152, 4, 4]           2,304
MemoryEfficientSwish-543           [-1, 1152, 4, 4]               0
        Identity-544           [-1, 1152, 1, 1]               0
Conv2dStaticSamePadding-545             [-1, 48, 1, 1]          55,344
MemoryEfficientSwish-546             [-1, 48, 1, 1]               0
        Identity-547             [-1, 48, 1, 1]               0
Conv2dStaticSamePadding-548           [-1, 1152, 1, 1]          56,448
        Identity-549           [-1, 1152, 4, 4]               0
Conv2dStaticSamePadding-550            [-1, 320, 4, 4]         368,640
     BatchNorm2d-551            [-1, 320, 4, 4]             640
     MBConvBlock-552            [-1, 320, 4, 4]               0
        Identity-553            [-1, 320, 4, 4]               0
Conv2dStaticSamePadding-554           [-1, 1280, 4, 4]         409,600
     BatchNorm2d-555           [-1, 1280, 4, 4]           2,560
MemoryEfficientSwish-556           [-1, 1280, 4, 4]               0
AdaptiveAvgPool2d-557           [-1, 1280, 1, 1]               0
        Identity-558                 [-1, 1280]               0
        Identity-559                 [-1, 1280]               0
    EfficientNet-560                 [-1, 1280]               0
          Linear-561                    [-1, 1]           2,561
         Sigmoid-562                    [-1, 1]               0
================================================================
Total params: 8,017,081
Trainable params: 8,017,081
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 3072.00
Forward/backward pass size (MB): 142.76
Params size (MB): 30.58
Estimated Total Size (MB): 3245.35
----------------------------------------------------------------
