----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
          Hardtanh-1          [-1, 3, 256, 256]               0
  SRMConv2d_simple-2          [-1, 3, 256, 256]               0
            Conv2d-3         [-1, 32, 127, 127]             864
       BatchNorm2d-4         [-1, 32, 127, 127]              64
              ReLU-5         [-1, 32, 127, 127]               0
            Conv2d-6         [-1, 32, 127, 127]             864
       BatchNorm2d-7         [-1, 32, 127, 127]              64
              ReLU-8         [-1, 32, 127, 127]               0
          Hardtanh-9         [-1, 96, 127, 127]               0
           Conv2d-10         [-1, 32, 127, 127]           3,072
      BatchNorm2d-11         [-1, 32, 127, 127]              64
             ReLU-12         [-1, 32, 127, 127]               0
SRMConv2d_Separate-13         [-1, 32, 127, 127]               0
             ReLU-14         [-1, 32, 127, 127]               0
           Conv2d-15         [-1, 64, 125, 125]          18,432
      BatchNorm2d-16         [-1, 64, 125, 125]             128
             ReLU-17         [-1, 64, 125, 125]               0
           Conv2d-18         [-1, 64, 125, 125]          18,432
      BatchNorm2d-19         [-1, 64, 125, 125]             128
             ReLU-20         [-1, 64, 125, 125]               0
         Hardtanh-21        [-1, 192, 125, 125]               0
           Conv2d-22         [-1, 64, 125, 125]          12,288
      BatchNorm2d-23         [-1, 64, 125, 125]             128
             ReLU-24         [-1, 64, 125, 125]               0
SRMConv2d_Separate-25         [-1, 64, 125, 125]               0
             ReLU-26         [-1, 64, 125, 125]               0
           Conv2d-27         [-1, 32, 127, 127]             864
      BatchNorm2d-28         [-1, 32, 127, 127]              64
             ReLU-29         [-1, 32, 127, 127]               0
           Conv2d-30         [-1, 64, 125, 125]          18,432
      BatchNorm2d-31         [-1, 64, 125, 125]             128
             ReLU-32         [-1, 64, 125, 125]               0
           Conv2d-33          [-1, 1, 125, 125]              98
          Sigmoid-34          [-1, 1, 125, 125]               0
 SpatialAttention-35          [-1, 1, 125, 125]               0
SRMPixelAttention-36          [-1, 1, 125, 125]               0
      BatchNorm2d-37         [-1, 64, 125, 125]             128
             ReLU-38         [-1, 64, 125, 125]               0
           Conv2d-39         [-1, 64, 125, 125]             576
           Conv2d-40        [-1, 128, 125, 125]           8,192
  SeparableConv2d-41        [-1, 128, 125, 125]               0
      BatchNorm2d-42        [-1, 128, 125, 125]             256
             ReLU-43        [-1, 128, 125, 125]               0
             ReLU-44        [-1, 128, 125, 125]               0
           Conv2d-45        [-1, 128, 125, 125]           1,152
           Conv2d-46        [-1, 128, 125, 125]          16,384
  SeparableConv2d-47        [-1, 128, 125, 125]               0
      BatchNorm2d-48        [-1, 128, 125, 125]             256
        MaxPool2d-49          [-1, 128, 63, 63]               0
           Conv2d-50          [-1, 128, 63, 63]           8,192
      BatchNorm2d-51          [-1, 128, 63, 63]             256
            Block-52          [-1, 128, 63, 63]               0
             ReLU-53          [-1, 128, 63, 63]               0
           Conv2d-54          [-1, 128, 63, 63]           1,152
           Conv2d-55          [-1, 256, 63, 63]          32,768
  SeparableConv2d-56          [-1, 256, 63, 63]               0
      BatchNorm2d-57          [-1, 256, 63, 63]             512
             ReLU-58          [-1, 256, 63, 63]               0
             ReLU-59          [-1, 256, 63, 63]               0
           Conv2d-60          [-1, 256, 63, 63]           2,304
           Conv2d-61          [-1, 256, 63, 63]          65,536
  SeparableConv2d-62          [-1, 256, 63, 63]               0
      BatchNorm2d-63          [-1, 256, 63, 63]             512
        MaxPool2d-64          [-1, 256, 32, 32]               0
           Conv2d-65          [-1, 256, 32, 32]          32,768
      BatchNorm2d-66          [-1, 256, 32, 32]             512
            Block-67          [-1, 256, 32, 32]               0
             ReLU-68          [-1, 256, 32, 32]               0
           Conv2d-69          [-1, 256, 32, 32]           2,304
           Conv2d-70          [-1, 728, 32, 32]         186,368
  SeparableConv2d-71          [-1, 728, 32, 32]               0
      BatchNorm2d-72          [-1, 728, 32, 32]           1,456
             ReLU-73          [-1, 728, 32, 32]               0
             ReLU-74          [-1, 728, 32, 32]               0
           Conv2d-75          [-1, 728, 32, 32]           6,552
           Conv2d-76          [-1, 728, 32, 32]         529,984
  SeparableConv2d-77          [-1, 728, 32, 32]               0
      BatchNorm2d-78          [-1, 728, 32, 32]           1,456
        MaxPool2d-79          [-1, 728, 16, 16]               0
           Conv2d-80          [-1, 728, 16, 16]         186,368
      BatchNorm2d-81          [-1, 728, 16, 16]           1,456
            Block-82          [-1, 728, 16, 16]               0
           Conv2d-83         [-1, 64, 125, 125]             576
           Conv2d-84        [-1, 128, 125, 125]           8,192
  SeparableConv2d-85        [-1, 128, 125, 125]               0
      BatchNorm2d-86        [-1, 128, 125, 125]             256
             ReLU-87        [-1, 128, 125, 125]               0
             ReLU-88        [-1, 128, 125, 125]               0
           Conv2d-89        [-1, 128, 125, 125]           1,152
           Conv2d-90        [-1, 128, 125, 125]          16,384
  SeparableConv2d-91        [-1, 128, 125, 125]               0
      BatchNorm2d-92        [-1, 128, 125, 125]             256
        MaxPool2d-93          [-1, 128, 63, 63]               0
           Conv2d-94          [-1, 128, 63, 63]           8,192
      BatchNorm2d-95          [-1, 128, 63, 63]             256
            Block-96          [-1, 128, 63, 63]               0
             ReLU-97          [-1, 128, 63, 63]               0
           Conv2d-98          [-1, 128, 63, 63]           1,152
           Conv2d-99          [-1, 256, 63, 63]          32,768
 SeparableConv2d-100          [-1, 256, 63, 63]               0
     BatchNorm2d-101          [-1, 256, 63, 63]             512
            ReLU-102          [-1, 256, 63, 63]               0
            ReLU-103          [-1, 256, 63, 63]               0
          Conv2d-104          [-1, 256, 63, 63]           2,304
          Conv2d-105          [-1, 256, 63, 63]          65,536
 SeparableConv2d-106          [-1, 256, 63, 63]               0
     BatchNorm2d-107          [-1, 256, 63, 63]             512
       MaxPool2d-108          [-1, 256, 32, 32]               0
          Conv2d-109          [-1, 256, 32, 32]          32,768
     BatchNorm2d-110          [-1, 256, 32, 32]             512
           Block-111          [-1, 256, 32, 32]               0
            ReLU-112          [-1, 256, 32, 32]               0
          Conv2d-113          [-1, 256, 32, 32]           2,304
          Conv2d-114          [-1, 728, 32, 32]         186,368
 SeparableConv2d-115          [-1, 728, 32, 32]               0
     BatchNorm2d-116          [-1, 728, 32, 32]           1,456
            ReLU-117          [-1, 728, 32, 32]               0
            ReLU-118          [-1, 728, 32, 32]               0
          Conv2d-119          [-1, 728, 32, 32]           6,552
          Conv2d-120          [-1, 728, 32, 32]         529,984
 SeparableConv2d-121          [-1, 728, 32, 32]               0
     BatchNorm2d-122          [-1, 728, 32, 32]           1,456
       MaxPool2d-123          [-1, 728, 16, 16]               0
          Conv2d-124          [-1, 728, 16, 16]         186,368
     BatchNorm2d-125          [-1, 728, 16, 16]           1,456
           Block-126          [-1, 728, 16, 16]               0
          Conv2d-127           [-1, 91, 16, 16]          66,339
          Conv2d-128           [-1, 91, 16, 16]           8,372
          Conv2d-129           [-1, 91, 16, 16]          66,339
          Conv2d-130           [-1, 91, 16, 16]           8,372
          Linear-131             [-1, 256, 256]          65,792
         Softmax-132             [-1, 256, 256]               0
          Linear-133             [-1, 256, 256]          65,792
         Softmax-134             [-1, 256, 256]               0
          Conv2d-135          [-1, 728, 16, 16]         530,712
          Conv2d-136          [-1, 728, 16, 16]         530,712
DualCrossModalAttention-137  [[-1, 728, 16, 16], [-1, 728, 16, 16]]               0
            ReLU-138          [-1, 728, 16, 16]               0
          Conv2d-139          [-1, 728, 16, 16]           6,552
          Conv2d-140          [-1, 728, 16, 16]         529,984
 SeparableConv2d-141          [-1, 728, 16, 16]               0
     BatchNorm2d-142          [-1, 728, 16, 16]           1,456
            ReLU-143          [-1, 728, 16, 16]               0
            ReLU-144          [-1, 728, 16, 16]               0
          Conv2d-145          [-1, 728, 16, 16]           6,552
          Conv2d-146          [-1, 728, 16, 16]         529,984
 SeparableConv2d-147          [-1, 728, 16, 16]               0
     BatchNorm2d-148          [-1, 728, 16, 16]           1,456
            ReLU-149          [-1, 728, 16, 16]               0
            ReLU-150          [-1, 728, 16, 16]               0
          Conv2d-151          [-1, 728, 16, 16]           6,552
          Conv2d-152          [-1, 728, 16, 16]         529,984
 SeparableConv2d-153          [-1, 728, 16, 16]               0
     BatchNorm2d-154          [-1, 728, 16, 16]           1,456
           Block-155          [-1, 728, 16, 16]               0
            ReLU-156          [-1, 728, 16, 16]               0
          Conv2d-157          [-1, 728, 16, 16]           6,552
          Conv2d-158          [-1, 728, 16, 16]         529,984
 SeparableConv2d-159          [-1, 728, 16, 16]               0
     BatchNorm2d-160          [-1, 728, 16, 16]           1,456
            ReLU-161          [-1, 728, 16, 16]               0
            ReLU-162          [-1, 728, 16, 16]               0
          Conv2d-163          [-1, 728, 16, 16]           6,552
          Conv2d-164          [-1, 728, 16, 16]         529,984
 SeparableConv2d-165          [-1, 728, 16, 16]               0
     BatchNorm2d-166          [-1, 728, 16, 16]           1,456
            ReLU-167          [-1, 728, 16, 16]               0
            ReLU-168          [-1, 728, 16, 16]               0
          Conv2d-169          [-1, 728, 16, 16]           6,552
          Conv2d-170          [-1, 728, 16, 16]         529,984
 SeparableConv2d-171          [-1, 728, 16, 16]               0
     BatchNorm2d-172          [-1, 728, 16, 16]           1,456
           Block-173          [-1, 728, 16, 16]               0
            ReLU-174          [-1, 728, 16, 16]               0
          Conv2d-175          [-1, 728, 16, 16]           6,552
          Conv2d-176          [-1, 728, 16, 16]         529,984
 SeparableConv2d-177          [-1, 728, 16, 16]               0
     BatchNorm2d-178          [-1, 728, 16, 16]           1,456
            ReLU-179          [-1, 728, 16, 16]               0
            ReLU-180          [-1, 728, 16, 16]               0
          Conv2d-181          [-1, 728, 16, 16]           6,552
          Conv2d-182          [-1, 728, 16, 16]         529,984
 SeparableConv2d-183          [-1, 728, 16, 16]               0
     BatchNorm2d-184          [-1, 728, 16, 16]           1,456
            ReLU-185          [-1, 728, 16, 16]               0
            ReLU-186          [-1, 728, 16, 16]               0
          Conv2d-187          [-1, 728, 16, 16]           6,552
          Conv2d-188          [-1, 728, 16, 16]         529,984
 SeparableConv2d-189          [-1, 728, 16, 16]               0
     BatchNorm2d-190          [-1, 728, 16, 16]           1,456
           Block-191          [-1, 728, 16, 16]               0
            ReLU-192          [-1, 728, 16, 16]               0
          Conv2d-193          [-1, 728, 16, 16]           6,552
          Conv2d-194          [-1, 728, 16, 16]         529,984
 SeparableConv2d-195          [-1, 728, 16, 16]               0
     BatchNorm2d-196          [-1, 728, 16, 16]           1,456
            ReLU-197          [-1, 728, 16, 16]               0
            ReLU-198          [-1, 728, 16, 16]               0
          Conv2d-199          [-1, 728, 16, 16]           6,552
          Conv2d-200          [-1, 728, 16, 16]         529,984
 SeparableConv2d-201          [-1, 728, 16, 16]               0
     BatchNorm2d-202          [-1, 728, 16, 16]           1,456
            ReLU-203          [-1, 728, 16, 16]               0
            ReLU-204          [-1, 728, 16, 16]               0
          Conv2d-205          [-1, 728, 16, 16]           6,552
          Conv2d-206          [-1, 728, 16, 16]         529,984
 SeparableConv2d-207          [-1, 728, 16, 16]               0
     BatchNorm2d-208          [-1, 728, 16, 16]           1,456
           Block-209          [-1, 728, 16, 16]               0
            ReLU-210          [-1, 728, 16, 16]               0
          Conv2d-211          [-1, 728, 16, 16]           6,552
          Conv2d-212          [-1, 728, 16, 16]         529,984
 SeparableConv2d-213          [-1, 728, 16, 16]               0
     BatchNorm2d-214          [-1, 728, 16, 16]           1,456
            ReLU-215          [-1, 728, 16, 16]               0
            ReLU-216          [-1, 728, 16, 16]               0
          Conv2d-217          [-1, 728, 16, 16]           6,552
          Conv2d-218          [-1, 728, 16, 16]         529,984
 SeparableConv2d-219          [-1, 728, 16, 16]               0
     BatchNorm2d-220          [-1, 728, 16, 16]           1,456
            ReLU-221          [-1, 728, 16, 16]               0
            ReLU-222          [-1, 728, 16, 16]               0
          Conv2d-223          [-1, 728, 16, 16]           6,552
          Conv2d-224          [-1, 728, 16, 16]         529,984
 SeparableConv2d-225          [-1, 728, 16, 16]               0
     BatchNorm2d-226          [-1, 728, 16, 16]           1,456
           Block-227          [-1, 728, 16, 16]               0
            ReLU-228          [-1, 728, 16, 16]               0
          Conv2d-229          [-1, 728, 16, 16]           6,552
          Conv2d-230          [-1, 728, 16, 16]         529,984
 SeparableConv2d-231          [-1, 728, 16, 16]               0
     BatchNorm2d-232          [-1, 728, 16, 16]           1,456
            ReLU-233          [-1, 728, 16, 16]               0
            ReLU-234          [-1, 728, 16, 16]               0
          Conv2d-235          [-1, 728, 16, 16]           6,552
          Conv2d-236          [-1, 728, 16, 16]         529,984
 SeparableConv2d-237          [-1, 728, 16, 16]               0
     BatchNorm2d-238          [-1, 728, 16, 16]           1,456
            ReLU-239          [-1, 728, 16, 16]               0
            ReLU-240          [-1, 728, 16, 16]               0
          Conv2d-241          [-1, 728, 16, 16]           6,552
          Conv2d-242          [-1, 728, 16, 16]         529,984
 SeparableConv2d-243          [-1, 728, 16, 16]               0
     BatchNorm2d-244          [-1, 728, 16, 16]           1,456
           Block-245          [-1, 728, 16, 16]               0
            ReLU-246          [-1, 728, 16, 16]               0
          Conv2d-247          [-1, 728, 16, 16]           6,552
          Conv2d-248          [-1, 728, 16, 16]         529,984
 SeparableConv2d-249          [-1, 728, 16, 16]               0
     BatchNorm2d-250          [-1, 728, 16, 16]           1,456
            ReLU-251          [-1, 728, 16, 16]               0
            ReLU-252          [-1, 728, 16, 16]               0
          Conv2d-253          [-1, 728, 16, 16]           6,552
          Conv2d-254          [-1, 728, 16, 16]         529,984
 SeparableConv2d-255          [-1, 728, 16, 16]               0
     BatchNorm2d-256          [-1, 728, 16, 16]           1,456
            ReLU-257          [-1, 728, 16, 16]               0
            ReLU-258          [-1, 728, 16, 16]               0
          Conv2d-259          [-1, 728, 16, 16]           6,552
          Conv2d-260          [-1, 728, 16, 16]         529,984
 SeparableConv2d-261          [-1, 728, 16, 16]               0
     BatchNorm2d-262          [-1, 728, 16, 16]           1,456
           Block-263          [-1, 728, 16, 16]               0
            ReLU-264          [-1, 728, 16, 16]               0
          Conv2d-265          [-1, 728, 16, 16]           6,552
          Conv2d-266          [-1, 728, 16, 16]         529,984
 SeparableConv2d-267          [-1, 728, 16, 16]               0
     BatchNorm2d-268          [-1, 728, 16, 16]           1,456
            ReLU-269          [-1, 728, 16, 16]               0
            ReLU-270          [-1, 728, 16, 16]               0
          Conv2d-271          [-1, 728, 16, 16]           6,552
          Conv2d-272          [-1, 728, 16, 16]         529,984
 SeparableConv2d-273          [-1, 728, 16, 16]               0
     BatchNorm2d-274          [-1, 728, 16, 16]           1,456
            ReLU-275          [-1, 728, 16, 16]               0
            ReLU-276          [-1, 728, 16, 16]               0
          Conv2d-277          [-1, 728, 16, 16]           6,552
          Conv2d-278          [-1, 728, 16, 16]         529,984
 SeparableConv2d-279          [-1, 728, 16, 16]               0
     BatchNorm2d-280          [-1, 728, 16, 16]           1,456
           Block-281          [-1, 728, 16, 16]               0
          Conv2d-282           [-1, 91, 16, 16]          66,339
          Conv2d-283           [-1, 91, 16, 16]           8,372
          Conv2d-284           [-1, 91, 16, 16]          66,339
          Conv2d-285           [-1, 91, 16, 16]           8,372
          Linear-286             [-1, 256, 256]          65,792
         Softmax-287             [-1, 256, 256]               0
          Linear-288             [-1, 256, 256]          65,792
         Softmax-289             [-1, 256, 256]               0
          Conv2d-290          [-1, 728, 16, 16]         530,712
          Conv2d-291          [-1, 728, 16, 16]         530,712
DualCrossModalAttention-292  [[-1, 728, 16, 16], [-1, 728, 16, 16]]               0
            ReLU-293          [-1, 728, 16, 16]               0
          Conv2d-294          [-1, 728, 16, 16]           6,552
          Conv2d-295          [-1, 728, 16, 16]         529,984
 SeparableConv2d-296          [-1, 728, 16, 16]               0
     BatchNorm2d-297          [-1, 728, 16, 16]           1,456
            ReLU-298          [-1, 728, 16, 16]               0
            ReLU-299          [-1, 728, 16, 16]               0
          Conv2d-300          [-1, 728, 16, 16]           6,552
          Conv2d-301          [-1, 728, 16, 16]         529,984
 SeparableConv2d-302          [-1, 728, 16, 16]               0
     BatchNorm2d-303          [-1, 728, 16, 16]           1,456
            ReLU-304          [-1, 728, 16, 16]               0
            ReLU-305          [-1, 728, 16, 16]               0
          Conv2d-306          [-1, 728, 16, 16]           6,552
          Conv2d-307          [-1, 728, 16, 16]         529,984
 SeparableConv2d-308          [-1, 728, 16, 16]               0
     BatchNorm2d-309          [-1, 728, 16, 16]           1,456
           Block-310          [-1, 728, 16, 16]               0
            ReLU-311          [-1, 728, 16, 16]               0
          Conv2d-312          [-1, 728, 16, 16]           6,552
          Conv2d-313          [-1, 728, 16, 16]         529,984
 SeparableConv2d-314          [-1, 728, 16, 16]               0
     BatchNorm2d-315          [-1, 728, 16, 16]           1,456
            ReLU-316          [-1, 728, 16, 16]               0
            ReLU-317          [-1, 728, 16, 16]               0
          Conv2d-318          [-1, 728, 16, 16]           6,552
          Conv2d-319          [-1, 728, 16, 16]         529,984
 SeparableConv2d-320          [-1, 728, 16, 16]               0
     BatchNorm2d-321          [-1, 728, 16, 16]           1,456
            ReLU-322          [-1, 728, 16, 16]               0
            ReLU-323          [-1, 728, 16, 16]               0
          Conv2d-324          [-1, 728, 16, 16]           6,552
          Conv2d-325          [-1, 728, 16, 16]         529,984
 SeparableConv2d-326          [-1, 728, 16, 16]               0
     BatchNorm2d-327          [-1, 728, 16, 16]           1,456
           Block-328          [-1, 728, 16, 16]               0
            ReLU-329          [-1, 728, 16, 16]               0
          Conv2d-330          [-1, 728, 16, 16]           6,552
          Conv2d-331          [-1, 728, 16, 16]         529,984
 SeparableConv2d-332          [-1, 728, 16, 16]               0
     BatchNorm2d-333          [-1, 728, 16, 16]           1,456
            ReLU-334          [-1, 728, 16, 16]               0
            ReLU-335          [-1, 728, 16, 16]               0
          Conv2d-336          [-1, 728, 16, 16]           6,552
          Conv2d-337          [-1, 728, 16, 16]         529,984
 SeparableConv2d-338          [-1, 728, 16, 16]               0
     BatchNorm2d-339          [-1, 728, 16, 16]           1,456
            ReLU-340          [-1, 728, 16, 16]               0
            ReLU-341          [-1, 728, 16, 16]               0
          Conv2d-342          [-1, 728, 16, 16]           6,552
          Conv2d-343          [-1, 728, 16, 16]         529,984
 SeparableConv2d-344          [-1, 728, 16, 16]               0
     BatchNorm2d-345          [-1, 728, 16, 16]           1,456
           Block-346          [-1, 728, 16, 16]               0
            ReLU-347          [-1, 728, 16, 16]               0
          Conv2d-348          [-1, 728, 16, 16]           6,552
          Conv2d-349          [-1, 728, 16, 16]         529,984
 SeparableConv2d-350          [-1, 728, 16, 16]               0
     BatchNorm2d-351          [-1, 728, 16, 16]           1,456
            ReLU-352          [-1, 728, 16, 16]               0
            ReLU-353          [-1, 728, 16, 16]               0
          Conv2d-354          [-1, 728, 16, 16]           6,552
          Conv2d-355          [-1, 728, 16, 16]         529,984
 SeparableConv2d-356          [-1, 728, 16, 16]               0
     BatchNorm2d-357          [-1, 728, 16, 16]           1,456
            ReLU-358          [-1, 728, 16, 16]               0
            ReLU-359          [-1, 728, 16, 16]               0
          Conv2d-360          [-1, 728, 16, 16]           6,552
          Conv2d-361          [-1, 728, 16, 16]         529,984
 SeparableConv2d-362          [-1, 728, 16, 16]               0
     BatchNorm2d-363          [-1, 728, 16, 16]           1,456
           Block-364          [-1, 728, 16, 16]               0
            ReLU-365          [-1, 728, 16, 16]               0
          Conv2d-366          [-1, 728, 16, 16]           6,552
          Conv2d-367          [-1, 728, 16, 16]         529,984
 SeparableConv2d-368          [-1, 728, 16, 16]               0
     BatchNorm2d-369          [-1, 728, 16, 16]           1,456
            ReLU-370          [-1, 728, 16, 16]               0
            ReLU-371          [-1, 728, 16, 16]               0
          Conv2d-372          [-1, 728, 16, 16]           6,552
          Conv2d-373          [-1, 728, 16, 16]         529,984
 SeparableConv2d-374          [-1, 728, 16, 16]               0
     BatchNorm2d-375          [-1, 728, 16, 16]           1,456
            ReLU-376          [-1, 728, 16, 16]               0
            ReLU-377          [-1, 728, 16, 16]               0
          Conv2d-378          [-1, 728, 16, 16]           6,552
          Conv2d-379          [-1, 728, 16, 16]         529,984
 SeparableConv2d-380          [-1, 728, 16, 16]               0
     BatchNorm2d-381          [-1, 728, 16, 16]           1,456
           Block-382          [-1, 728, 16, 16]               0
            ReLU-383          [-1, 728, 16, 16]               0
          Conv2d-384          [-1, 728, 16, 16]           6,552
          Conv2d-385          [-1, 728, 16, 16]         529,984
 SeparableConv2d-386          [-1, 728, 16, 16]               0
     BatchNorm2d-387          [-1, 728, 16, 16]           1,456
            ReLU-388          [-1, 728, 16, 16]               0
            ReLU-389          [-1, 728, 16, 16]               0
          Conv2d-390          [-1, 728, 16, 16]           6,552
          Conv2d-391          [-1, 728, 16, 16]         529,984
 SeparableConv2d-392          [-1, 728, 16, 16]               0
     BatchNorm2d-393          [-1, 728, 16, 16]           1,456
            ReLU-394          [-1, 728, 16, 16]               0
            ReLU-395          [-1, 728, 16, 16]               0
          Conv2d-396          [-1, 728, 16, 16]           6,552
          Conv2d-397          [-1, 728, 16, 16]         529,984
 SeparableConv2d-398          [-1, 728, 16, 16]               0
     BatchNorm2d-399          [-1, 728, 16, 16]           1,456
           Block-400          [-1, 728, 16, 16]               0
            ReLU-401          [-1, 728, 16, 16]               0
          Conv2d-402          [-1, 728, 16, 16]           6,552
          Conv2d-403          [-1, 728, 16, 16]         529,984
 SeparableConv2d-404          [-1, 728, 16, 16]               0
     BatchNorm2d-405          [-1, 728, 16, 16]           1,456
            ReLU-406          [-1, 728, 16, 16]               0
            ReLU-407          [-1, 728, 16, 16]               0
          Conv2d-408          [-1, 728, 16, 16]           6,552
          Conv2d-409          [-1, 728, 16, 16]         529,984
 SeparableConv2d-410          [-1, 728, 16, 16]               0
     BatchNorm2d-411          [-1, 728, 16, 16]           1,456
            ReLU-412          [-1, 728, 16, 16]               0
            ReLU-413          [-1, 728, 16, 16]               0
          Conv2d-414          [-1, 728, 16, 16]           6,552
          Conv2d-415          [-1, 728, 16, 16]         529,984
 SeparableConv2d-416          [-1, 728, 16, 16]               0
     BatchNorm2d-417          [-1, 728, 16, 16]           1,456
           Block-418          [-1, 728, 16, 16]               0
            ReLU-419          [-1, 728, 16, 16]               0
          Conv2d-420          [-1, 728, 16, 16]           6,552
          Conv2d-421          [-1, 728, 16, 16]         529,984
 SeparableConv2d-422          [-1, 728, 16, 16]               0
     BatchNorm2d-423          [-1, 728, 16, 16]           1,456
            ReLU-424          [-1, 728, 16, 16]               0
            ReLU-425          [-1, 728, 16, 16]               0
          Conv2d-426          [-1, 728, 16, 16]           6,552
          Conv2d-427          [-1, 728, 16, 16]         529,984
 SeparableConv2d-428          [-1, 728, 16, 16]               0
     BatchNorm2d-429          [-1, 728, 16, 16]           1,456
            ReLU-430          [-1, 728, 16, 16]               0
            ReLU-431          [-1, 728, 16, 16]               0
          Conv2d-432          [-1, 728, 16, 16]           6,552
          Conv2d-433          [-1, 728, 16, 16]         529,984
 SeparableConv2d-434          [-1, 728, 16, 16]               0
     BatchNorm2d-435          [-1, 728, 16, 16]           1,456
           Block-436          [-1, 728, 16, 16]               0
            ReLU-437          [-1, 728, 16, 16]               0
          Conv2d-438          [-1, 728, 16, 16]           6,552
          Conv2d-439          [-1, 728, 16, 16]         529,984
 SeparableConv2d-440          [-1, 728, 16, 16]               0
     BatchNorm2d-441          [-1, 728, 16, 16]           1,456
            ReLU-442          [-1, 728, 16, 16]               0
            ReLU-443          [-1, 728, 16, 16]               0
          Conv2d-444          [-1, 728, 16, 16]           6,552
          Conv2d-445         [-1, 1024, 16, 16]         745,472
 SeparableConv2d-446         [-1, 1024, 16, 16]               0
     BatchNorm2d-447         [-1, 1024, 16, 16]           2,048
       MaxPool2d-448           [-1, 1024, 8, 8]               0
          Conv2d-449           [-1, 1024, 8, 8]         745,472
     BatchNorm2d-450           [-1, 1024, 8, 8]           2,048
           Block-451           [-1, 1024, 8, 8]               0
          Conv2d-452           [-1, 1024, 8, 8]           9,216
          Conv2d-453           [-1, 1536, 8, 8]       1,572,864
 SeparableConv2d-454           [-1, 1536, 8, 8]               0
     BatchNorm2d-455           [-1, 1536, 8, 8]           3,072
            ReLU-456           [-1, 1536, 8, 8]               0
          Conv2d-457           [-1, 1536, 8, 8]          13,824
          Conv2d-458           [-1, 2048, 8, 8]       3,145,728
 SeparableConv2d-459           [-1, 2048, 8, 8]               0
     BatchNorm2d-460           [-1, 2048, 8, 8]           4,096
            ReLU-461          [-1, 728, 16, 16]               0
          Conv2d-462          [-1, 728, 16, 16]           6,552
          Conv2d-463          [-1, 728, 16, 16]         529,984
 SeparableConv2d-464          [-1, 728, 16, 16]               0
     BatchNorm2d-465          [-1, 728, 16, 16]           1,456
            ReLU-466          [-1, 728, 16, 16]               0
            ReLU-467          [-1, 728, 16, 16]               0
          Conv2d-468          [-1, 728, 16, 16]           6,552
          Conv2d-469         [-1, 1024, 16, 16]         745,472
 SeparableConv2d-470         [-1, 1024, 16, 16]               0
     BatchNorm2d-471         [-1, 1024, 16, 16]           2,048
       MaxPool2d-472           [-1, 1024, 8, 8]               0
          Conv2d-473           [-1, 1024, 8, 8]         745,472
     BatchNorm2d-474           [-1, 1024, 8, 8]           2,048
           Block-475           [-1, 1024, 8, 8]               0
          Conv2d-476           [-1, 1024, 8, 8]           9,216
          Conv2d-477           [-1, 1536, 8, 8]       1,572,864
 SeparableConv2d-478           [-1, 1536, 8, 8]               0
     BatchNorm2d-479           [-1, 1536, 8, 8]           3,072
            ReLU-480           [-1, 1536, 8, 8]               0
          Conv2d-481           [-1, 1536, 8, 8]          13,824
          Conv2d-482           [-1, 2048, 8, 8]       3,145,728
 SeparableConv2d-483           [-1, 2048, 8, 8]               0
     BatchNorm2d-484           [-1, 2048, 8, 8]           4,096
          Conv2d-485           [-1, 2048, 8, 8]       8,388,608
     BatchNorm2d-486           [-1, 2048, 8, 8]           4,096
            ReLU-487           [-1, 2048, 8, 8]               0
AdaptiveAvgPool2d-488           [-1, 2048, 1, 1]               0
          Conv2d-489            [-1, 128, 1, 1]         262,144
            ReLU-490            [-1, 128, 1, 1]               0
          Conv2d-491           [-1, 2048, 1, 1]         262,144
AdaptiveMaxPool2d-492           [-1, 2048, 1, 1]               0
          Conv2d-493            [-1, 128, 1, 1]         262,144
            ReLU-494            [-1, 128, 1, 1]               0
          Conv2d-495           [-1, 2048, 1, 1]         262,144
         Sigmoid-496           [-1, 2048, 1, 1]               0
ChannelAttention-497           [-1, 2048, 1, 1]               0
FeatureFusionModule-498           [-1, 2048, 8, 8]               0
            ReLU-499           [-1, 2048, 8, 8]               0
         Dropout-500                 [-1, 2048]               0
          Linear-501                    [-1, 1]           2,049
================================================================
Total params: 53,777,359
Trainable params: 53,777,359
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.75
Forward/backward pass size (MB): 528675.94
Params size (MB): 205.14
Estimated Total Size (MB): 528881.83
----------------------------------------------------------------
